% 1. Κυκλική συνέλιξη N σημείων
% Δίνονται τα σήματα πεπερασμένου μήκους
% x1(n) = [1 4 3], n ∈ [0,2] και x2(n) = [5 8 2 1], n ∈ [0,3]
% Να υπολογίσετε 
% - την κυκλική συνέλιξη 5 σημείων y5(n) των σημάτων x1 (n) και x2 (n)
% - την κυκλική συνέλιξη 6 σημείων y6(n) των σημάτων x1(n) και x2(n)

clc;
pkg load signal
x1 = [1 4 3];
x2 = [5 8 2 1];

% - κυκλική συνέλιξη 5 σημείων
clin_5 = cconv(x1,x2,5);
disp(clin_5);

% - κυκλική συνέλιξη 6 σημείων
clin_6 = cconv(x1,x2,6);
disp(clin_6);